"""
Accès aux données d'un tableau

Éditeur : Laurent REYNAUD
Date : 22-07-2021
"""

In [2]:
import pandas as pd

In [3]:
"Chargement du fichier"

test = pd.read_csv('C:/Users\LRCOM/pythonProjects/ds_pandas/data/weather.csv')
test

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [4]:
"Transposition des données"

test.T

,0,1,2,3,4,5,6,7,8
date,5/1/2017,5/2/2017,5/3/2017,5/1/2017,5/2/2017,5/3/2017,5/1/2017,5/2/2017,5/3/2017
city,new york,new york,new york,mumbai,mumbai,mumbai,beijing,beijing,beijing
temperature,65,66,68,75,78,82,80,77,79
humidity,56,58,60,80,83,85,26,30,35

In [5]:
"Accès aux données de la colonne 'city"

test['city']

0    new york
1    new york
2    new york
3      mumbai
4      mumbai
5      mumbai
6     beijing
7     beijing
8     beijing
Name: city, dtype: object

In [56]:
"Accès aux données des colonnes 'date' et 'humidity'"

test[['date','humidity']]

       date  humidity
0  5/1/2017        56
1  5/2/2017        58
2  5/3/2017        60
3  5/1/2017        80
4  5/2/2017        83
5  5/3/2017        85
6  5/1/2017        26
7  5/2/2017        30
8  5/3/2017        35

In [59]:
"Accès aux colonnes 'city' à 'humidity'"

test.iloc[:, 1:4]

       city  temperature  humidity
0  new york           65        56
1  new york           66        58
2  new york           68        60
3    mumbai           75        80
4    mumbai           78        83
5    mumbai           82        85
6   beijing           80        26
7   beijing           77        30
8   beijing           79        35

In [55]:
"Accès aux lignes indexées 4 à 6"

test.loc[4:6]

       date     city  temperature  humidity
4  5/2/2017   mumbai           78        83
5  5/3/2017   mumbai           82        85
6  5/1/2017  beijing           80        26

In [63]:
"Accès au 2 premières lignes"

test.head(2)

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58

In [65]:
"Accès au 2 dernières lignes"

test.tail(2)

       date     city  temperature  humidity
7  5/2/2017  beijing           77        30
8  5/3/2017  beijing           79        35

In [71]:
"Températures de la ville de New-york : 1ère méthode"

test[test['city'] == 'new york']['temperature']

0    65
1    66
2    68
Name: temperature, dtype: int64

In [5]:
"Températures de la ville de New-york : 2ème méthode"

test.loc[0:2, ('city', 'temperature')]

       city  temperature
0  new york           65
1  new york           66
2  new york           68

In [66]:
"Accès aux données ayant une température < de 70"

test[test['temperature'] < 70]

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60

In [68]:
"Accès aux villes ayant une température < de 70"

test[test['temperature'] < 70]['city']

0    new york
1    new york
2    new york
Name: city, dtype: object

In [69]:
"Accès aux données ayant une température < de 70 et une humidité > 56"

test[(test['temperature'] < 70) & (test['humidity'] > 56)]

       date      city  temperature  humidity
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60